In [20]:
import pandas as pd
data = [[1, 1], [1, 2], [1, 3], [2, 1], [2, 4]]
project = pd.DataFrame(data, columns=['project_id', 'employee_id']).astype({'project_id':'Int64', 'employee_id':'Int64'})
data = [[1, 'Khaled', 3], [2, 'Ali', 2], [3, 'John', 1], [4, 'Doe', 2]]
employee = pd.DataFrame(data, columns=['employee_id', 'name', 'experience_years']).astype({'employee_id':'Int64', 'name':'object', 'experience_years':'Int64'})

In [21]:
project

   project_id  employee_id
0           1            1
1           1            2
2           1            3
3           2            1
4           2            4

In [22]:
employee

   employee_id    name  experience_years
0            1  Khaled                 3
1            2     Ali                 2
2            3    John                 1
3            4     Doe                 2

In [23]:
ryt_join = project.merge(employee, on="employee_id", how="right")

In [24]:
ryt_join

   project_id  employee_id    name  experience_years
0           1            1  Khaled                 3
1           2            1  Khaled                 3
2           1            2     Ali                 2
3           1            3    John                 1
4           2            4     Doe                 2

In [25]:
avg_exp = ryt_join.groupby("project_id").mean("expierence_years").round(2).reset_index().dropna()

In [26]:
avg_exp = avg_exp.rename(columns={'experience_years': 'average_years'})

In [27]:
avg_exp

   project_id  employee_id  average_years
0           1          2.0            2.0
1           2          2.5            2.5